microsoft/uf2-samdx1/lib/samd21/samd21a/atdf/ATSAMD21J15A.atdf
        <register offset="0x00000180" size="4" name="NVICICPR" initval="0" caption="Interrupt Clear Pending Register">
          <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
        </register>
        <register offset="0x00000300" size="4" name="NVICIPR0" initval="0" caption="Interrupt Priority Register 0">
          <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
          <bitfield mask="0x0000ff00" name="PRI1" caption="Priority of interrupt 1"/>
          <bitfield mask="0x00ff0000" name="PRI2" caption="Priority of interrupt 2"/>
          <bitfield mask="0xff000000" name="PRI3" caption="Priority of interrupt 3"/>
        </register>
        <register offset="0x00000304" size="4" name="NVICIPR1" initval="0" caption="Interrupt Priority Register 1">
          <bitfield mask="0x000000ff" name="PRI4" caption="Priority of interrupt 4"/>
          <bitfield mask="0x0000ff00" name="PRI5" caption="Priority of interrupt 5"/>
          <bitfield mask="0x00ff0000" name="PRI6" caption="Priority of interrupt 6"/>
          <bitfield mask="0xff000000" name="PRI7" caption="Priority of interrupt 7"/>
        </register>
        <register offset="0x00000308" size="4" name="NVICIPR2" initval="0" caption="Interrupt Priority Register 2">
          <bitfield mask="0x000000ff" name="PRI8" caption="Priority of interrupt 8"/>
          <bitfield mask="0x0000ff00" name="PRI9" caption="Priority of interrupt 9"/>
          <bitfield mask="0x00ff0000" name="PRI10" caption="Priority of interrupt 10"/>
          <bitfield mask="0xff000000" name="PRI11" caption="Priority of interrupt 11"/>
        </register>
        <register offset="0x0000030C" size="4" name="NVICIPR3" initval="0" caption="Interrupt Priority Register 3">
          <bitfield mask="0x000000ff" name="PRI12" caption="Priority of interrupt 12"/>
          <bitfield mask="0x0000ff00" name="PRI13" caption="Priority of interrupt 13"/>
          <bitfield mask="0x00ff0000" name="PRI14" caption="Priority of interrupt 14"/>
          <bitfield mask="0xff000000" name="PRI15" caption="Priority of interrupt 15"/>
        </register>
        <register offset="0x00000310" size="4" name="NVICIPR4" initval="0" caption="Interrupt Priority Register 4">
          <bitfield mask="0x000000ff" name="PRI16" caption="Priority of interrupt 16"/>
          <bitfield mask="0x0000ff00" name="PRI17" caption="Priority of interrupt 17"/>
          <bitfield mask="0x00ff0000" name="PRI18" caption="Priority of interrupt 18"/>
          <bitfield mask="0xff000000" name="PRI19" caption="Priority of interrupt 19"/>
        </register>
        <register offset="0x00000314" size="4" name="NVICIPR5" initval="0" caption="Interrupt Priority Register 5">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
          <bitfield mask="0x0000ff00" name="PRI21" caption="Priority of interrupt 21"/>
          <bitfield mask="0x00ff0000" name="PRI22" caption="Priority of interrupt 22"/>
          <bitfield mask="0xff000000" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="4" name="NVICIPR6" initval="0" caption="Interrupt Priority Register 6">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
          <bitfield mask="0x0000ff00" name="PRI25" caption="Priority of interrupt 25"/>
          <bitfield mask="0x00ff0000" name="PRI26" caption="Priority of interrupt 26"/>
          <bitfield mask="0xff000000" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031C" size="4" name="NVICIPR7" initval="0" caption="Interrupt Priority Register 7">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
          <bitfield mask="0x0000ff00" name="PRI29" caption="Priority of interrupt 29"/>
          <bitfield mask="0x00ff0000" name="PRI30" caption="Priority of interrupt 30"/>
          <bitfield mask="0xff000000" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
      </register-group>
    </module></modules>
  <pinouts>
    <pinout name="SAMD21J" caption="SAMD21J">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="PB04"/>
      <pin position="6" pad="PB05"/>
      <pin position="7" pad="GNDANA"/>
      <pin position="8" pad="VDDANA"/>
      <pin position="9" pad="PB06"/>
      <pin position="10" pad="PB07"/>
      <pin position="11" pad="PB08"/>
      <pin position="12" pad="PB09"/>
      <pin position="13" pad="PA04"/>
      <pin position="14" pad="PA05"/>
      <pin position="15" pad="PA06"/>
      <pin position="16" pad="PA07"/>
      <pin position="17" pad="PA08"/>
      <pin position="18" pad="PA09"/>
      <pin position="19" pad="PA10"/>
      <pin position="20" pad="PA11"/>
      <pin position="21" pad="VDDIO02"/>
      <pin position="22" pad="GNDIO02"/>
      <pin position="23" pad="PB10"/>
      <pin position="24" pad="PB11"/>
      <pin position="25" pad="PB12"/>
      <pin position="26" pad="PB13"/>
      <pin position="27" pad="PB14"/>
      <pin position="28" pad="PB15"/>
      <pin position="29" pad="PA12"/>
      <pin position="30" pad="PA13"/>
      <pin position="31" pad="PA14"/>
      <pin position="32" pad="PA15"/>
      <pin position="33" pad="GNDIO03"/>
      <pin position="34" pad="VDDIO03"/>
      <pin position="35" pad="PA16"/>
      <pin position="36" pad="PA17"/>
      <pin position="37" pad="PA18"/>
      <pin position="38" pad="PA19"/>
      <pin position="39" pad="PB16"/>
      <pin position="40" pad="PB17"/>
      <pin position="41" pad="PA20"/>
      <pin position="42" pad="PA21"/>
      <pin position="43" pad="PA22"/>
      <pin position="44" pad="PA23"/>
      <pin position="45" pad="PA24"/>
      <pin position="46" pad="PA25"/>
      <pin position="47" pad="GNDIO04"/>
      <pin position="48" pad="VDDIO04"/>
      <pin position="49" pad="PB22"/>
      <pin position="50" pad="PB23"/>
      <pin position="51" pad="PA27"/>
      <pin position="52" pad="RESET_N"/>
      <pin position="53" pad="PA28"/>
      <pin position="54" pad="GNDIO"/>
      <pin position="55" pad="VDDCORE"/>
      <pin position="56" pad="VDDIN"/>
      <pin position="57" pad="PA30"/>
      <pin position="58" pad="PA31"/>
      <pin position="59" pad="PB30"/>
      <pin position="60" pad="PB31"/>
      <pin position="61" pad="PB00"/>
      <pin position="62" pad="PB01"/>
      <pin position="63" pad="PB02"/>
      <pin position="64" pad="PB03"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>